In [1]:
import numpy as np
import pandas as pd

In [5]:
df = pd.DataFrame(np.random.randn(5,4)-1)
df

          0         1         2         3
0  0.094347 -2.202718 -0.918293 -2.951851
1 -0.937437 -1.081271 -2.352765 -1.698574
2 -0.183238 -1.301198 -1.581021 -1.334807
3 -0.581586 -1.518935 -0.806783 -0.497057
4 -0.404412 -1.880281 -0.335988 -1.458517

In [9]:
df=np.abs(df)
df

          0         1         2         3
0  0.094347  2.202718  0.918293  2.951851
1  0.937437  1.081271  2.352765  1.698574
2  0.183238  1.301198  1.581021  1.334807
3  0.581586  1.518935  0.806783  0.497057
4  0.404412  1.880281  0.335988  1.458517

In [10]:
df.apply(lambda x : x.max())

0    0.937437
1    2.202718
2    2.352765
3    2.951851
dtype: float64

In [12]:
df.apply(lambda x : x.max(), axis=1)

0    2.951851
1    2.352765
2    1.581021
3    1.518935
4    1.880281
dtype: float64

In [13]:
df.applymap(lambda x:"%.2f" % x)

      0     1     2     3
0  0.09  2.20  0.92  2.95
1  0.94  1.08  2.35  1.70
2  0.18  1.30  1.58  1.33
3  0.58  1.52  0.81  0.50
4  0.40  1.88  0.34  1.46

排序

In [15]:
s1 = pd.Series(np.arange(4),index=list("bdca"))
s1

b    0
d    1
c    2
a    3
dtype: int32

In [16]:
s1.sort_index()

a    3
b    0
c    2
d    1
dtype: int32

In [18]:
s1.sort_index(ascending = False)

d    1
c    2
b    0
a    3
dtype: int32

In [22]:
pd1 = pd.DataFrame({"B":[4,7,2,4], "C":[1,2,3,4], "A":[4,5,3,6]},index=list("bdca"))
pd1

   B  C  A
b  4  1  4
d  7  2  5
c  2  3  3
a  4  4  6

In [23]:
pd1.sort_index()

   B  C  A
a  4  4  6
b  4  1  4
c  2  3  3
d  7  2  5

In [24]:
pd1.sort_index(axis=1)

   A  B  C
b  4  4  1
d  5  7  2
c  3  2  3
a  6  4  4

按值排序

In [41]:
s1=pd.Series(np.random.rand(5),index=list("bdcae"))
s1=s1.apply(lambda x:"%.2f" % x)
s1

b    0.51
d    0.77
c    0.83
a    0.68
e    0.71
dtype: object

In [42]:
s1["a"]=np.nan
s1

b    0.51
d    0.77
c    0.83
a     NaN
e    0.71
dtype: object

In [45]:
s1.sort_values(ascending=False)

c    0.83
d    0.77
e    0.71
b    0.51
a     NaN
dtype: object

In [53]:
pd1["A"]=[4,4,3,6]
pd1["C"]=[2,1,3,4]
pd1

   B  C  A
b  4  2  4
d  7  1  4
c  2  3  3
a  4  4  6

In [54]:
pd1.sort_values(by=["A"])

   B  C  A
c  2  3  3
b  4  2  4
d  7  1  4
a  4  4  6

In [55]:
pd1.sort_values(by=["A","C"])

   B  C  A
c  2  3  3
d  7  1  4
b  4  2  4
a  4  4  6

In [56]:
pd2 = pd.DataFrame({'a':[3,7,9,0],'b':[1,-1,4,8],'c':[0,6,-3,2]})
pd2

   a  b  c
0  3  1  0
1  7 -1  6
2  9  4 -3
3  0  8  2

In [58]:
pd2.sort_values(by="b",ascending=False)

   a  b  c
3  0  8  2
2  9  4 -3
0  3  1  0
1  7 -1  6

In [59]:
s1 = pd.Series([2,6,8,9,8,3,6],index=['a','a','c','c','c','c','c'])
s1

a    2
a    6
c    8
c    9
c    8
c    3
c    6
dtype: int64

In [60]:
s1.unique()

array([2, 6, 8, 9, 3], dtype=int64)

In [61]:
s1.index.is_unique

False

In [64]:
s2=pd.Series(np.arange(5))
s2

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [63]:
s2.index.is_unique

True

In [65]:
s1.value_counts()

8    2
6    2
9    1
2    1
3    1
dtype: int64

In [66]:
s1.isin([8])

a    False
a    False
c     True
c    False
c     True
c    False
c    False
dtype: bool

In [68]:
s1.isin([6,8])

a    False
a     True
c     True
c    False
c     True
c    False
c     True
dtype: bool

In [69]:
data = pd.DataFrame({'a':[3,7,9,0],'b':[1,-1,4,8],'c':[0,6,-3,2]})
data

   a  b  c
0  3  1  0
1  7 -1  6
2  9  4 -3
3  0  8  2

In [70]:
data.isin([2,4])

       a      b      c
0  False  False  False
1  False  False  False
2  False   True  False
3  False  False   True

In [72]:
df3=pd.DataFrame([np.arange(3),[1,2,np.nan],[2,np.nan,3]])
df3

   0    1    2
0  0  1.0  2.0
1  1  2.0  NaN
2  2  NaN  3.0

In [73]:
df3.isnull()

       0      1      2
0  False  False  False
1  False  False   True
2  False   True  False

In [74]:
df3.dropna()

   0    1    2
0  0  1.0  2.0

In [75]:
df3.dropna(axis=1)

   0
0  0
1  1
2  2

In [76]:
df3.fillna(-1000)

   0       1       2
0  0     1.0     2.0
1  1     2.0 -1000.0
2  2 -1000.0     3.0